# ETL Pipeline

## Collect Data

In [1]:
# import necessary packages
import pandas as pd

In [2]:
# import the dataset as a pandas dataframe
pdf_one = pd.read_csv('dataset3.csv')
pdf_two = pd.read_csv('dataset4.csv')

## A quick look in data structure

In [3]:
# see the five first entries of the dataset
pdf_one.head()

,corporation,lastmonth_activity,lastyear_activity,number_of_employees,exited
0,nciw,45,0,99,1
1,lsid,36,234,541,0
2,pwls,23,555,23,0
3,bqlx,15,11,190,1
4,zmei,100,2929,999,1

In [4]:
# see the five first entries of the dataset
pdf_two.head()

,corporation,lastmonth_activity,lastyear_activity,number_of_employees,exited
0,abcd,99,871,3,0
1,asdf,1243,0,10,0
2,xyzz,0,25,11,1
3,acme,813,129,9,1
4,qwer,2989,9982,90,0

In [5]:
# verify the size type and null data
pdf_one.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   corporation          11 non-null     object
 1   lastmonth_activity   11 non-null     int64
 2   lastyear_activity    11 non-null     int64
 3   number_of_employees  11 non-null     int64
 4   exited               11 non-null     int64
dtypes: int64(4), object(1)
memory usage: 568.0+ bytes

In [6]:
# verify the size type and null data
pdf_two.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   corporation          15 non-null     object
 1   lastmonth_activity   15 non-null     int64
 2   lastyear_activity    15 non-null     int64
 3   number_of_employees  15 non-null     int64
 4   exited               15 non-null     int64
dtypes: int64(4), object(1)
memory usage: 728.0+ bytes

## ETL Pipeline

In [7]:
# 1. Merge the datasets